app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-11-22 15:47:21.771228"], ["updated_at", "2018-11-22 15:47:21.771228"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["created_at", "2018-11-22 15:47:21.811950"], ["updated_at", "2018-11-22 15:47:21.811950"]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(product: product)

    respond_to do |format|
      if @line_item.save

UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2018-11-22 16:15:59.786477"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @line_item.update(line_item_params)